Public Attributes | List of all members
API_MonolithPartsVisibilityData Struct Reference
Element Manager
Describes which types of monolith parts are visible. More...
#include <APIdefs_Elements.h>
 Public Attributes
 bool  | connectionVisible
Connection visibility settings.
 bool  | drainingVisible
Draining visibility settings.
 bool  | landingLineVisible
Landing line visibility settings.
 bool  | structureGoingVisible
Structure going visibility settings.
 bool  | structureGoingNosingVisible
Structure going nosing visibility settings.
Detailed Description
Describes which types of monolith parts are visible.